app/views/questions/show.html.erb

      <li><%= comment.body %></li>
      <p>- <%= link_to User.find(comment.commenter_id).username, user_path(User.find(comment.commenter_id)) %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]


<% unless @question.answers.empty? %>
---
SELECT  1 AS one FROM "answers" WHERE "answers"."question_id" = $1 LIMIT $2  [["question_id", 2], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 4]]