app/controllers/answers_controller.rb

  def new
    @question = Question.find(params[:question_id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @question = Question.find(params[:question_id])
    @answer = @question.answers.new(answer_params)
    @answer.user_id = current_user.id
    @answer.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "answers" ("body", "question_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "stuff"], ["question_id", 1], ["user_id", 1], ["created_at", 2016-12-09 02:52:12 UTC], ["updated_at", 2016-12-09 02:52:12 UTC]]