app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "commenter_id", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "Thing"], ["commenter_id", 1], ["commentable_id", 2], ["commentable_type", "Question"], ["created_at", 2016-12-09 13:47:05 UTC], ["updated_at", 2016-12-09 13:47:05 UTC]]
---
  def create
    @comment = @question.comments.new(comment_params)
    @comment.commenter_id = current_user.id
    @comment.commentable_id = @question.id
    @comment.commentable_type = "Question"
    if @comment.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def find_question
      @question = Question.find(params[:question_id])