app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
  def index
    link = "http://api.giphy.com/v1/gifs/random?api_key=dc6zaTOxFJmzC&tag=puppies"
    @gif = JSON.parse(open(link).read)["data"]["image_url"]
    @questions = Question.all

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 5]]
---
  def show
    @answers = @question.answers.all

INSERT INTO "questions" ("author_id", "body", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 4], ["body", "HI CRUD"], ["title", "CRUD"], ["created_at", 2016-12-05 20:42:18 UTC], ["updated_at", 2016-12-05 20:42:18 UTC]]
---
  def create
    @question =  Question.new(question_params)
    @question.author_id = current_user.id
    if @question.save

UPDATE "questions" SET "title" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["title", "Blog 109"], ["updated_at", 2016-12-05 21:04:41 UTC], ["id", 4]]
---
  def update
    if @question.update(question_params)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def find_question
    @question = Question.find(params[:id])